# Explanation

# First of all
this is Data telling story of Teacher Kholed Langsari.
- He is a Teacher of Computer knowledge from Fatoni University.
- This is the data that told about history of Teacher Kholed that have teached.

## Upload

Upload The data form teacher kholed.

In [7]:
df=pd.read_excel('D:/Games/DataFrame of T.kholed/kholed-subject-teach.xlsx')

## Import

import all of this module to work with data.

In [6]:
import seaborn as sns
import pandas as pd
from pandas import Series,DataFrame
import numpy as np
import matplotlib.pyplot as plt

# Checking

Checking step is check the data
- How many data.
- How is it.
- How do we manange with it.

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 28 entries, 0 to 27
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Unnamed: 0   0 non-null      float64
 1   Unnamed: 1   0 non-null      float64
 2   Unnamed: 2   0 non-null      float64
 3   Unnamed: 3   0 non-null      float64
 4   Unnamed: 4   0 non-null      float64
 5   Unnamed: 5   26 non-null     object
 6   Unnamed: 6   24 non-null     object
 7   Unnamed: 7   22 non-null     object
 8   Unnamed: 8   22 non-null     object
 9   Unnamed: 9   22 non-null     object
 10  Unnamed: 10  1 non-null      object
dtypes: float64(5), object(6)
memory usage: 2.5+ KB

In [9]:
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,รหัสวิชา,รายวิชา,กลุ่ม,จำนวนรับ,ลงแล้ว,ส่งออก
3,NaN,NaN,NaN,NaN,NaN,ภาคการศึกษาที่ 1,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,มหาวิทยาลัยฟาฏอนี,ปริญญาตรี,NaN,NaN,NaN,NaN

In [10]:
df.tail()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
23,NaN,NaN,NaN,NaN,NaN,IT2301-214,พื้นฐานปัญญาประดิษฐ์,2,10,0,NaN
24,NaN,NaN,NaN,NaN,NaN,IT2301-229,DevOps,1,8,0,NaN
25,NaN,NaN,NaN,NaN,NaN,IT2301-229,DevOps,2,5,0,NaN
26,NaN,NaN,NaN,NaN,NaN,IT2301-318,ปัญญาประดิษฐ์ขั้นพื้นฐาน,1,18,0,NaN
27,NaN,NaN,NaN,NaN,NaN,IT2301-318,ปัญญาประดิษฐ์ขั้นพื้นฐาน,2,5,0,NaN

In [11]:
df.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10'],
      dtype='object')

In [12]:
df.isnull().sum()

Unnamed: 0     28
Unnamed: 1     28
Unnamed: 2     28
Unnamed: 3     28
Unnamed: 4     28
Unnamed: 5      2
Unnamed: 6      4
Unnamed: 7      6
Unnamed: 8      6
Unnamed: 9      6
Unnamed: 10    27
dtype: int64

In [13]:
df.describe()

       Unnamed: 0  Unnamed: 1  Unnamed: 2  Unnamed: 3  Unnamed: 4
count         0.0         0.0         0.0         0.0         0.0
mean          NaN         NaN         NaN         NaN         NaN
std           NaN         NaN         NaN         NaN         NaN
min           NaN         NaN         NaN         NaN         NaN
25%           NaN         NaN         NaN         NaN         NaN
50%           NaN         NaN         NaN         NaN         NaN
75%           NaN         NaN         NaN         NaN         NaN
max           NaN         NaN         NaN         NaN         NaN

The dataset is not clean yet. We had to make it ready.

# To Be Continue...